# Pandas Puzzles

- These are the puzzles for testing your knowledge of pandas power

- Since pandas is a large library with many different specialist features and functions, these excercises focus mainly on the fundamentals of manipulating data (indexing, grouping, aggregating, cleaning), making use of the core DataFrame and Series objects.

- Many of the excerises here are stright-forward in that the solutions require no more than a few lines of code (in pandas or NumPy... don't go using pure Python or Cython!). Choosing the right methods and following best practices is the underlying goal.

- If you're just starting out with pandas and you are looking for some other resources, the official documentation is very extensive. In particular, some good places get a broader overview of pandas are...

## Importing pandas

### Getting started and checking your pandas setup

1. Import pandas under the alias pd.

In [1]:
import pandas as pd

2. Print the version of pandas that has been imported.

In [2]:
pd.__version__

'1.2.5'

3. Print out all the version information of the libraries that are required by the pandas library.

In [3]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : 7c48ff4409c622c582c56a5702373f726de08e96
python           : 3.9.6.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.19042
machine          : AMD64
processor        : Intel64 Family 6 Model 15 Stepping 6, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United States.1252

pandas           : 1.2.5
numpy            : 1.21.0
pytz             : 2021.1
dateutil         : 2.8.1
pip              : 21.2.2
setuptools       : 56.0.0
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : 4.6.3
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.0.1
IPython          : 7.25.0
pandas_datareader: None
bs4              : 4.9.3
bottleneck       : None
fsspec           : None
fastparquet      : None
gcsfs            : None
matplotlib       : 3.4.2
numexpr          : None
odfpy            : None
openpyxl         : None
pandas_gbq       : None
pyarrow          : None
pyxlsb           : None
s3fs             : None
scipy            : 1.7.0
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
numba            : None

### DataFrame basics

- A few of the fundamental routines for selecting, sorting, adding and aggregating data in DataFrames

Note: remember to import numpy using:

In [4]:
import numpy as np

- (This is just some meaningless data I made up with the theme of animals and trips to a vet.)

4. Create a DataFrame df from this dictionary data which has the index labels.

In [5]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)

In [6]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

5. Display a summary of the basic information about this DataFrame and its data,Descriptive Statistics

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [8]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

6. Display is there any null values present in it

In [9]:
df.isna().sum()

animal      0
age         2
visits      0
priority    0
dtype: int64

In [10]:
df.notnull().sum()

animal      10
age          8
visits      10
priority    10
dtype: int64

In [11]:
df.isnull().sum()

animal      0
age         2
visits      0
priority    0
dtype: int64

7.Returns the first three rows of the dataframe

In [12]:
df.iloc[:3]  #or df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

**8. Select just the 'animal' and 'age' columns from the DataFrame df.**

In [13]:
df.loc[:,['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [14]:
df[['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

#### 9. Select the data in rows [3, 4, 8] and in columns ['animal', 'age'].

In [15]:
df.loc[df.index[[3,4,8]],['animal','age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

10. Select only the rows where the number of visits is greater than 2.

In [16]:
df[df['visits']>2]

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

11. Select the rows were the age is missing

In [17]:
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

12. Select the rows where the animal is a cat and the age is less than 3.

In [18]:
df[(df['animal']=='cat') & (df['age']<3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

12. Select the rows the age is between 2 and 4 (inclusive).

In [19]:
df[df['age'].between(2,4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

13. Change the age in row 'f' to 1.5.

In [20]:
df.loc['f','age']=1.5

In [21]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

14. Calculate the sum of all visits in df (i.e. the total number of visits).

In [22]:
df['visits'].sum()

19

15. Calculate the mean age for each different animal in df.

In [23]:
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

16. Append a new row 'k' to df with your choice of values for each column. Then delete that row to return the original DataFrame.

In [24]:
df.loc['k'] = [5.5,'dog','no',2]

df = df.drop('k')

17. Count the number of each type of animal in df.

In [25]:
df['animal'].value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

18. Sort df first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order (so row i should be first, and row d should be last).

In [26]:
df.sort_values(by=['age','visits'],ascending=[False,True])

  animal  age visits priority
i    dog  7.0      2       no
e    dog  5.0      2       no
g  snake  4.5      1       no
j    dog  3.0      1       no
b    cat  3.0      3      yes
a    cat  2.5      1      yes
f    cat  1.5      3       no
c  snake  0.5      2       no
h    cat  NaN      1      yes
d    dog  NaN      3      yes

19. The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be True and 'no' should be False.

In [27]:
df['priority']=df['priority'].map({'yes':True,'no':False})

20. In the 'animal' column, change the 'snake' entries to 'python'.

In [28]:
df['animal']=df['animal'].replace('snake','python')

In [29]:
df['age'].value_counts().idxmax()

3.0

In [30]:
df['age'].value_counts().idxmin()

0.5

# DataFrames: beyond the basics

### Slightly trickier: you may need to combine two or more methods to get the right answer

The previous section was tour through some basic but essential DataFrame operations. Below are some ways that you might need to cut your data, but for which there is no single "out of the box" method.


22. You have a DataFrame df with a column 'A' of integers. For example:

df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
How do you filter out rows which contain the same integer as the row immediately above?

You should be left with a column containing the following values:

1, 2, 3, 4, 5, 6, 7

In [31]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})

In [32]:
df.drop_duplicates(subset='A')

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

23. Given a DataFrame of random numeric values:

df = pd.DataFrame(np.random.random(size=(5, 3))) # this is a 5x3 DataFrame of float values
how do you subtract the row mean from each element in the row?

In [56]:
df = pd.DataFrame(np.random.random(size=(5, 3)))

In [57]:
df

          0         1         2
0  0.603277  0.392691  0.668586
1  0.515279  0.276293  0.239440
2  0.111542  0.997294  0.309949
3  0.206359  0.021077  0.568042
4  0.967157  0.721481  0.234183

In [34]:
df.sub(df.mean(axis=1),axis=0)

          0         1         2
0 -0.293223  0.042589  0.250635
1  0.123029 -0.190968  0.067938
2  0.095300 -0.330739  0.235439
3 -0.290149  0.302291 -0.012142
4  0.077268 -0.004319 -0.072949

24. Suppose you have DataFrame with 10 columns of real numbers, for example:

df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
Which column of numbers has the smallest sum?
Which column of numbers has largest sum?
Return that column's label.

In [35]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))

In [36]:
df

,a,b,c,d,e,f,g,h,i,j
0,0.854607,0.643608,0.937249,0.369356,0.165214,0.727305,0.380807,0.483558,0.494951,0.085856
1,0.300300,0.794440,0.576299,0.965654,0.506070,0.217475,0.226065,0.439472,0.577722,0.895569
2,0.645351,0.920727,0.051077,0.075533,0.610472,0.032946,0.958292,0.005043,0.575999,0.546737
3,0.732763,0.173321,0.371781,0.010599,0.199314,0.497077,0.900394,0.447300,0.471188,0.888212
4,0.569595,0.632243,0.654452,0.193664,0.816251,0.598652,0.618589,0.679674,0.807660,0.075674

Smallest

In [37]:
df.sum().idxmin()

'd'

Largest

In [38]:
df.sum().idxmax()

'b'

25. How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?

In [39]:
df = pd.DataFrame(np.random.randint(0,2,size=(10,3)))

In [40]:
len(df.drop_duplicates(keep=False))

1

In [41]:
len(df)-df.duplicated(keep=False).sum()

1

26. In the cell below, you have a DataFrame df that consists of 10 columns of floating-point numbers. Exactly 5 entries in each row are NaN values.

For each row of the DataFrame, find the column which contains the third NaN value.

You should return a Series of column labels: e, c, d, h, d

In [42]:
nan = np.nan

data = [[0.04,  nan,  nan, 0.25,  nan, 0.43, 0.71, 0.51,  nan,  nan],
        [ nan,  nan,  nan, 0.04, 0.76,  nan,  nan, 0.67, 0.76, 0.16],
        [ nan,  nan, 0.5 ,  nan, 0.31, 0.4 ,  nan,  nan, 0.24, 0.01],
        [0.49,  nan,  nan, 0.62, 0.73, 0.26, 0.85,  nan,  nan,  nan],
        [ nan,  nan, 0.41,  nan, 0.05,  nan, 0.61,  nan, 0.48, 0.68]]

columns = list('abcdefghij')

df = pd.DataFrame(data, columns=columns)

In [43]:
df

      a   b     c     d     e     f     g     h     i     j
0  0.04 NaN   NaN  0.25   NaN  0.43  0.71  0.51   NaN   NaN
1   NaN NaN   NaN  0.04  0.76   NaN   NaN  0.67  0.76  0.16
2   NaN NaN  0.50   NaN  0.31  0.40   NaN   NaN  0.24  0.01
3  0.49 NaN   NaN  0.62  0.73  0.26  0.85   NaN   NaN   NaN
4   NaN NaN  0.41   NaN  0.05   NaN  0.61   NaN  0.48  0.68

In [44]:
(df.isnull().cumsum(axis=1)==3).idxmax(axis=1)

0    e
1    c
2    d
3    h
4    d
dtype: object


27. A DataFrame has a column of groups 'grps' and and column of integer values 'vals':

df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
For each group, find the sum of the three greatest values. You should end up with the answer as follows:

grps
a    409
b    156
c    345

In [45]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

In [46]:
df

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a    52
8     b    54
9     c    23
10    c   235
11    c    21
12    b    57
13    b     3
14    c    87

In [47]:
df.groupby('grps')['vals'].nlargest(3).sum(level=0)

grps
a    409
b    156
c    345
Name: vals, dtype: int64

28. Some values in the the FlightNumber column are missing (they are NaN). These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Modify df to fill in these missing numbers and make the column an integer column (instead of a float column).

In [48]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
             })

In [49]:
df

            From_To  FlightNumber
0      LoNDon_paris       10045.0
1      MAdrid_miLAN           NaN
2  londON_StockhOlm       10065.0
3    Budapest_PaRis           NaN
4   Brussels_londOn       10085.0

In [50]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)

In [51]:
df

            From_To  FlightNumber
0      LoNDon_paris         10045
1      MAdrid_miLAN         10055
2  londON_StockhOlm         10065
3    Budapest_PaRis         10075
4   Brussels_londOn         10085

29. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame called 'temp' with the correct values. Assign the correct column names 'From' and 'To' to this temporary DataFrame.

In [52]:
temp = df.From_To.str.split('_',expand=True)
temp.columns = ['From','To']
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

30. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame 'temp'. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [53]:
temp['From'] = temp['From'].str.capitalize()
temp['To'] = temp['To'].str.capitalize()
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [54]:
df = df.drop('From_To',axis=1)

In [55]:
df=df.join(temp)
df

   FlightNumber      From         To
0         10045    London      Paris
1         10055    Madrid      Milan
2         10065    London  Stockholm
3         10075  Budapest      Paris
4         10085  Brussels     London

### Thank You

More Exercises to follow soon...